Revit 2027 API
FamilyManager.CanElementParameterBeAssociated Method
Indicates if this element parameter can be associated with a family parameter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool CanElementParameterBeAssociated(
	Parameter elementParameter
)
Public Function CanElementParameterBeAssociated (
	elementParameter As Parameter
) As Boolean
public:
bool CanElementParameterBeAssociated(
	Parameter^ elementParameter
)
member CanElementParameterBeAssociated :
        elementParameter : Parameter -> bool
Parameters
elementParameter Parameter
Return Value
Boolean
See Also
Reference
FamilyManager Class
Autodesk.Revit.DB Namespace